СМП_ОнлайнОбменДанными/cfe/src/Catalogs/ПравилаКонвертацииСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертацииСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПравилаКонвертацииОбъектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриемника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоКонвертации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПравилаКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьИзВходящихДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриВыгрузкеСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОбработкиВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗамещать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПриводитьЗначениеКДлинеПриемника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПараметраДляПередачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоДатеНаРавенство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьГруппуЧерезФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриЗагрузкеСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/Catalogs/ПравилаКонвертацииСвойств/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураПолей = Новый Структура("ОбъектИсточник, ОбъектПриемник, УчетнаяЗаписьОбменаДанными", "Источник", "Приемник", "Владелец");
	РеквизитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец, СтруктураПолей);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыВладельца);
	
	пвИсточник = Новый Массив;
	пвИсточник.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ОбъектИсточник));
	
	пвПриемник = Новый Массив;
	пвПриемник.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ОбъектПриемник));
	
	Если Не Объект.Родитель.Пустая() Тогда
		
		РеквизитыРодителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Родитель, "Источник, Приемник");
		пвИсточник.Добавить(Новый ПараметрВыбора("Отбор.Родитель", РеквизитыРодителя.Источник));
		пвПриемник.Добавить(Новый ПараметрВыбора("Отбор.Родитель", РеквизитыРодителя.Приемник));
		
	КонецЕсли;
	
	Элементы.Источник.ПараметрыВыбора = Новый ФиксированныйМассив(пвИсточник);
	Элементы.Приемник.ПараметрыВыбора = Новый ФиксированныйМассив(пвПриемник);
	
	ЭтотОбъект.ПередаватьДанныеВПриемник = НЕ ЗначениеЗаполнено(Объект.ИмяПараметраДляПередачи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
	// Редактор кода
	#Если ВебКлиент Тогда
		
	#Иначе
		НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("ЗагрузитьРедакторКода", ЭтотОбъект));
	#КонецЕсли
	
	ОбновитьТекущийАктивныйОбработчик();
	ОбновитьНаличиеОбработчиковАлгоритмов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Редактор кода
	Объект.АлгоритмПередВыгрузкойСвойства = Элементы.АлгоритмПередВыгрузкойСвойстваРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПриВыгрузкеСвойства = Элементы.АлгоритмПриВыгрузкеСвойстваРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПослеВыгрузкиСвойства = Элементы.АлгоритмПослеВыгрузкиСвойстваРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПередЗагрузкойСвойства = Элементы.АлгоритмПередЗагрузкойСвойстваРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПриЗагрузкеСвойства = Элементы.АлгоритмПриЗагрузкеСвойстваРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПослеЗагрузкиСвойства = Элементы.АлгоритмПослеЗагрузкиСвойстваРедактор.Документ.defaultView.editor.getValue();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Источник)
		И НЕ ЗначениеЗаполнено(Объект.Приемник) Тогда
		ИсточникПриИзмененииНаСервере();
		АвтоматическиНайтиНужноеПравилоПКО();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриемникПриИзменении(Элемент)
	
	ПриемникПриИзмененииНаСервере();
	//ОбновитьТипы();
	АвтоматическиНайтиНужноеПравилоПКО();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура СтраницыАлгоритмыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновитьТекущийАктивныйОбработчик();
КонецПроцедуры

&НаКлиенте
Процедура ПередаватьДанныеВПриемникПриИзменении(Элемент)
	
	Если ПередаватьДанныеВПриемник Тогда
		Объект.ИмяПараметраДляПередачи = "";
	Иначе
		Объект.Приемник = ПредопределенноеЗначение("Справочник.Свойства.ПустаяСсылка");
	КонецЕсли;
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьРедакторКода(Команда)
	
	ТекстОбработчика = Элементы[ТекущийАктивныйОбработчик + "Редактор"].Документ.defaultView.editor.getValue();
	мПараметры = Новый Структура("ТекстОбработчика", ТекстОбработчика);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияРедактораКода", ЭтотОбъект);
	ОткрытьФорму("Обработка.СМП_РедакторКода.Форма", мПараметры, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик оповещения.
//
&НаКлиенте
Процедура ПослеЗакрытияРедактораКода(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Элементы[ТекущийАктивныйОбработчик + "Редактор"].Документ.defaultView.editor.setValue(РезультатЗакрытия);
	
	Если РезультатЗакрытия <> Объект[ТекущийАктивныйОбработчик] Тогда
		Объект[ТекущийАктивныйОбработчик] = РезультатЗакрытия;
		Модифицированность = Истина;
		ОбновитьНаличиеОбработчиковАлгоритмов();
	КонецЕсли;
	
КонецПроцедуры //ПослеЗакрытияРедактораКода

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Функция АвтоматическиНайтиНужноеПравилоПКО(ЗадаватьВопрос = Ложь)
	
	Если ЗначениеЗаполнено(Объект.ПравилоКонвертации) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СписокПКО = НайтиПравилаКО(УчетнаяЗаписьОбменаДанными, Объект.Источник, Объект.Приемник);
	КоличествоЭлементов = СписокПКО.Количество();
	
	Если КоличествоЭлементов = 1 Тогда
		
		Если ЗадаватьВопрос Тогда
			
			ТекстВопроса = "Найдено правило конвертации объектов для типов данных приемника и источника.
				|Применить это правило конвертации для данного правила конвертации свойств?";
			Обещание = ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Ответ = Ждать Обещание;
			НеобходимоПодставитьНовоеПравило = ?(Ответ = КодВозвратаДиалога.Да, Истина, Ложь);
		Иначе
			
			НеобходимоПодставитьНовоеПравило = Истина;
		КонецЕсли;
		
		Если НеобходимоПодставитьНовоеПравило Тогда
			Объект.ПравилоКонвертации = СписокПКО[0].Значение;
		КонецЕсли;
		
		// нашли нужное правило
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// .
//
// Параметры:
//   УчетнаяЗапись - СправочникСсылка.СМП_УчетныеЗаписиОбменов - владелец ПКО.
//   СвойствоИсточник - СправочникСсылка.Свойства - реквизит источник.
//   СвойствоПриемник - СправочникСсылка.Свойства - реквизит приемник.
//
// Возвращаемое значение:
//   СписокЗначений - Список найденых ПКО.
//
&НаСервереБезКонтекста
Функция НайтиПравилаКО(УчетнаяЗапись, СвойствоИсточник, СвойствоПриемник) 
	
	СписокПКО = Справочники.ПравилаКонвертацииСвойств.НайтиПравилаКО(УчетнаяЗапись, СвойствоИсточник, СвойствоПриемник);
	
	Возврат СписокПКО;
	
КонецФункции // НайтиПравилаКО

// .
//
// Параметры:
//   Нет.
//
&НаСервере
Процедура ИсточникПриИзмененииНаСервере() 
	
	НаименованиеИсточника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Источник, "Наименование");
	
	// ищем приемник по наименованию
	Объект.Приемник = Справочники.Свойства.НайтиПоНаименованию(НаименованиеИсточника, , , ОбъектПриемник);
	
	Если НЕ ЗначениеЗаполнено(Объект.Приемник)
		И СМП_ОбщегоНазначения.ИмяРеквизитаМожетБытьИзменено(НаименованиеИсточника) Тогда
		
		НовоеНаименованиеСвойства = СМП_ОбщегоНазначения.ПолучитьАналогИмениРеквизита(НаименованиеИсточника);
		Объект.Приемник = Справочники.Свойства.НайтиПоНаименованию(НовоеНаименованиеСвойства, , , ОбъектПриемник);
	КонецЕсли;
	
	//ОбновитьТипы();
	Объект.Наименование = СМП_ОбщегоНазначения.глНаименованиеПКС(Объект);
	
КонецПроцедуры //ИсточникПриИзмененииНаСервере

// .
//
// Параметры:
//   Нет.
//
&НаСервере
Процедура ПриемникПриИзмененииНаСервере() 
	
	Объект.Наименование = СМП_ОбщегоНазначения.глНаименованиеПКС(Объект);
	
КонецПроцедуры //ПриемникПриИзмененииНаСервере


// Видимость элементов формы
//
// Параметры:
//   Нет.
//
&НаКлиенте
Процедура УстановитьВидимость() 
	
	Элементы.Приемник.Видимость = ПередаватьДанныеВПриемник;
	Элементы.ИмяПараметраДляПередачи.Видимость = НЕ ПередаватьДанныеВПриемник;
	
КонецПроцедуры //УстановитьВидимость

// Редактор кода
&НаКлиенте
Процедура ЗагрузитьРедакторКода(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт
	
	ДанныеПолей = Новый Соответствие;
	ДанныеПолей.Вставить("АлгоритмПередВыгрузкойСвойстваРедактор", Объект.АлгоритмПередВыгрузкойСвойства);
	ДанныеПолей.Вставить("АлгоритмПриВыгрузкеСвойстваРедактор", Объект.АлгоритмПриВыгрузкеСвойства);
	ДанныеПолей.Вставить("АлгоритмПослеВыгрузкиСвойстваРедактор", Объект.АлгоритмПослеВыгрузкиСвойства);
	ДанныеПолей.Вставить("АлгоритмПередЗагрузкойСвойстваРедактор", Объект.АлгоритмПередЗагрузкойСвойства);
	ДанныеПолей.Вставить("АлгоритмПриЗагрузкеСвойстваРедактор", Объект.АлгоритмПриЗагрузкеСвойства);
	ДанныеПолей.Вставить("АлгоритмПослеЗагрузкиСвойстваРедактор", Объект.АлгоритмПослеЗагрузкиСвойства);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтотОбъект, ДанныеПолей, ИмяКаталогаВременныхФайлов);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаличиеОбработчиковАлгоритмов()

	Картинка = БиблиотекаКартинок.СинтаксическийКонтроль;
	ПустаяКартинка = Новый Картинка;
	
	Если ЗначениеЗаполнено(Объект.АлгоритмПередВыгрузкойСвойства)
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПриВыгрузкеСвойства)
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПослеВыгрузкиСвойства)
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПередЗагрузкойСвойства) 
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПриЗагрузкеСвойства) 
		ИЛИ ЗначениеЗаполнено(Объект.АлгоритмПослеЗагрузкиСвойства)
		Тогда
		Элементы.СтраницаОбработчикиСобытий.Картинка = Картинка;
	Иначе
		Элементы.СтраницаОбработчикиСобытий.Картинка = ПустаяКартинка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.АлгоритмПередВыгрузкойСвойства) Тогда
		Элементы.СтраницаАлгоритмПередВыгрузкойСвойства.Картинка = Картинка;
	Иначе
		Элементы.СтраницаАлгоритмПередВыгрузкойСвойства.Картинка = ПустаяКартинка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.АлгоритмПриВыгрузкеСвойства) Тогда
		Элементы.СтраницаАлгоритмПриВыгрузкеСвойства.Картинка = Картинка;
	Иначе
		Элементы.СтраницаАлгоритмПриВыгрузкеСвойства.Картинка = ПустаяКартинка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.АлгоритмПослеВыгрузкиСвойства) Тогда
		Элементы.СтраницаАлгоритмПослеВыгрузкиСвойства.Картинка = Картинка;
	Иначе
		Элементы.СтраницаАлгоритмПослеВыгрузкиСвойства.Картинка = ПустаяКартинка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.АлгоритмПередЗагрузкойСвойства) Тогда
		Элементы.СтраницаАлгоритмПередЗагрузкойСвойства.Картинка = Картинка;
	Иначе
		Элементы.СтраницаАлгоритмПередЗагрузкойСвойства.Картинка = ПустаяКартинка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.АлгоритмПриЗагрузкеСвойства) Тогда
		Элементы.СтраницаАлгоритмПриЗагрузкеСвойства.Картинка = Картинка;
	Иначе
		Элементы.СтраницаАлгоритмПриЗагрузкеСвойства.Картинка = ПустаяКартинка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.АлгоритмПослеЗагрузкиСвойства) Тогда
		Элементы.СтраницаАлгоритмПослеЗагрузкиСвойства.Картинка = Картинка;
	Иначе
		Элементы.СтраницаАлгоритмПослеЗагрузкиСвойства.Картинка = ПустаяКартинка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущийАктивныйОбработчик() 
	
	ИмяТекВкладки = Элементы.СтраницыАлгоритмы.ТекущаяСтраница.Имя;
	ТекущийАктивныйОбработчик = СтрЗаменить(ИмяТекВкладки, "Страница", "");
	
КонецПроцедуры //ОбновитьТекущийАктивныйОбработчик

#КонецОбласти
